/*
Домашнее задание
Многопоточное выполнение команд

Цель:
Разработка многопоточной системы выполнения команд на примере игры "Космический бой".

В результате выполнения ДЗ будет получен код, отвечающий за выполнение множества команд в несколько потоков, устойчивый к появлению новых видов команд и дополнительных ограничений, накладываемых на них.


Описание/Пошаговая инструкция выполнения домашнего задания:
Предположим, что у нас есть набор команд, которые необходимо выполнить. Выполнение команд организуем в несколько потоков.
Для этого будем считать, что у каждого потока есть своя потокобезопасная очередь.
Для того, чтобы выполнить команду, ее необходимо добавить в очередь. Поток читает очередную команду из очереди и выполняет ее.
Если выполнение команды прерывается выброшенным исключением, то поток должен отловить его и продолжить работу.
Если сообщений нет в очереди, то поток засыпает до тех пор, пока очередь пуста.

Последовательность шагов решения:

Реализовать код, который запускается в отдельном потоке и делает следующее
В цикле получает из потокобезопасной очереди команду и запускает ее.
Выброс исключения из команды не должен прерывать выполнение потока.
Написать команду, которая стартует код, написанный в пункте 1 в отдельном потоке.
Написать команду, которая останавливает цикл выполнения команд из пункта 1, не дожидаясь их полного завершения (hard stop).
Написать команду, которая останавливает цикл выполнения команд из пункта 1, только после того, как все команды завершат свою работу (soft stop).
Написать тесты на команду запуска и остановки потока.

Критерии оценки:
За выполнение каждого пункта, перечисленного ниже начисляются баллы:

ДЗ сдано на проверку - 2 балла
Код решения опубликован на github/gitlab - 1 балл
Настроен CI - 2 балла
Код компилируется без ошибок - 1 балл.
Написать тест, который проверяет, что после команды старт поток запущен - 1балл и 4 балла - если используются условные события синхронизации.
Написать тест, который проверяет, что после команды hard stop, поток завершается - 1 балл
Написать тест, который проверяет, что после команды soft stop, поток завершается только после того, как все задачи закончились - 2 балла
Итого: 10 баллов
Задание считается принятым, если набрано не менее 7 баллов.
*/
